class HealthBlogContent
{
  final String imgpath;
  final String headingtext;
  final String text;
  final double width;
  final double height;
  HealthBlogContent({required this.imgpath,required this.headingtext,required this.text,required this.width,required this.height});
}
List<HealthBlogContent> blogcontent=
[
  HealthBlogContent(width: 326,height: 264.44,imgpath: 'assets/images/blog1.png', headingtext: 'خالی پیٹ لہسن کھائیں اور 7 فائدے اُٹھائیں', text: 'زمانہ قدیم سے انسان لہسن کا استعمال کرتا آیا ہے ۔ رومن ، مصری ، ایرانی ، یہود ، عرب اور دنیا کی تمام اقوام نے لہسن کے فوائد پر گفتگو کی ہے اور کسی نے آج تک اس کے استعمال کو خطرناک نہیں کہا جبکہ اسے مصالحہ جات کا سردار بھی کہا گیا ہے ۔ لیکن آج ہم آپ کو لہسن کے خالی پیسٹ استعمال کے فوائس بتائیں گے ۔'),
  HealthBlogContent(width: 330,height: 393.13,imgpath: 'assets/images/blog2.png', headingtext: 'کیا آپ بھی لمبے عرصے تک جوان رہنا چاہتے ہیں، مضبوط ہڈیاں اور لمبے گھنے بال ،تخم بالنگا حسن اور صحت دونوں کا ضامن', text: 'قدرت نے اپنے بیش بہا خزانوں میں انسانوں کے لئے بے شمار انمول تحفے چھپا رکھے ہیں، ضرورت صرف اس بات کی ہے کہ ہم ان خزانوں کو دریا فت کریں اور ان سے فائدہ اٹھائیں،تلسی کے پودوں سے حاصل ہونے والے سیاہ بیج جنہیں عام طور پر تخم بالنگا کہا جاتا ہے، اس کے اصل نام سے ناواقف لوگ اسے تخ ملنگا بھی کہتے ہیں۔تخم بالنگا اومیگا تھری فیٹی ایسڈ، آئرن، فائبر، کیلشیم، اینٹی آکسیڈینٹ کےعلاوہ پروٹین سے بھی بھرپُور ہوتا ہے۔ اس بیج میں شامل اینٹی آکسیڈنٹ اجزاء ذیابیطس کنٹرول کرنے میں مدد کرتے ہیں اور جلد کو بھی فائدہ پہنچاتے ہیں۔یونائیٹڈ سٹیٹ ڈیپارٹمنٹ آف ایگری کلچر کے مطابق 26 گرام تخم بالنگا میں 120 کیلوریز، 5 گرام چکنائی، 14 گرام کاربوہائیڈریٹس، 14 گرام ڈائیٹری فائبر،تقریباً 4 گرام پروٹین اور صفر شوگر ہوتی ہے۔ تخم بالنگا کا دن میں ایک مرتبہ استعمال روزانہ کی جسمانی ضرورت کے مقابلے میں18فی صد تک کیلشیم مہیا کرتا ہے۔'),
  HealthBlogContent(width: 330,height: 311.63,imgpath: 'assets/images/blog3.png', headingtext: 'صبح نہار منہ 1 ابلا ہوا انڈا کیوں کھانا چاہیئے؟ جانیں اسکے ایسے حیران کن فوائد، جس کے بعد آپ بھی اسے روزانہ کھانا چاہیں گے', text: 'ناشتے کو دن کی اہم غذا کہا جاتا ہے، اسے چھوڑنا وزن میں غیر معمولی اضافے یا کمی کا سبب بن سکتا ہے ساتھ ہی یہ یاداشت کو بھی متاثر کر سکتا ہے۔ اسلیئے صبح میں ناشتہ لازمی کریں اور کوشش کریں کہ کسی صحت مند غذا کا انتخاب کریں جیسے کہ اُبلے ہوئے انڈے کھانا ایک بہترین انتخاب ہے۔'),
];